{
  "backend/main.mo": "Defines all core game types, progress models, comparison helpers, and in-memory data maps, with authorization mixin and placeholders for user-facing query/update methods.",
  "backend/migration.mo": "Implements migration logic converting old progress data to the new format by adding difficulty fields and initializing level progress.",
  "feature_evidence.json": "Lists implemented features, related files, components, and test IDs for difficulty, question generation, times tables, and rewards.",
  "frontend-file-summaries.txt": "Provides concise summaries of many frontend files covering routing, UI components, hooks, state, and game logic.",
  "frontend/index.css": "Defines Tailwind base layers and extensive CSS variables for light and dark themes with custom color tokens.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/public/videos/README.txt": "Explains required help video files, naming conventions, formats, and recommended resolutions.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, age‑group guards, and global providers for the main React app layout.",
  "frontend/src/components/errors/GlobalErrorBoundary.tsx": "React error boundary that catches UI errors and displays a themed recovery screen with reload option.",
  "frontend/src/components/game/AnswerPad.tsx": "Numeric input pad component that builds a number string and submits it. Supports clear, submit, and disabled state.",
  "frontend/src/components/game/DifficultySelector.tsx": "Card-based radio selector for choosing a difficulty level using predefined options. Updates parent via onChange.",
  "frontend/src/components/game/FeedbackBanner.tsx": "Displays a correct or incorrect feedback banner with icon and random message. Hidden when no type is provided.",
  "frontend/src/components/help/helpTopics.ts": "Defines HelpTopic type and a list of help topics with video paths, fallback text, and emojis.",
  "frontend/src/components/help/HelpVideoCard.tsx": "Renders a help topic with a video player and fallback text on error. Shows topic title, emoji, and content inside a card.",
  "frontend/src/components/layout/KidLayout.tsx": "Page layout with themed background, navigation, age badge, main content slot, and footer.",
  "frontend/src/components/layout/PageHeader.tsx": "Centered page header showing title, optional subtitle, emoji, and optional mascot.",
  "frontend/src/components/layout/PageShell.tsx": "Wrapper component that constrains max width and provides vertical spacing for pages.",
  "frontend/src/components/layout/SelectedAgeBadge.tsx": "Displays a fixed-position badge showing the selected age group using context data.",
  "frontend/src/components/mascot/Mascot.tsx": "Shows an animated mascot image that varies by state (idle, cheer, encourage).",
  "frontend/src/components/nav/MainNav.tsx": "Top navigation bar with labeled icon buttons that highlight the active route and navigate using TanStack Router.",
  "frontend/src/components/progress/StarsRow.tsx": "Renders a row of stars indicating progress, with filled stars animated based on count.",
  "frontend/src/game/difficulty.ts": "Defines frontend difficulty options, mapping to backend difficulty, and provides multipliers for question count and range.",
  "frontend/src/game/questionGenerator.ts": "Generates math questions based on game type, age group, and difficulty using randomized number ranges.",
  "frontend/src/game/roundEngine.ts": "Manages round state, scoring, progression, and produces final round results with stars and time spent.",
  "frontend/src/game/timesTables.ts": "Generates times table data and questions, supporting difficulty-based question counts and predefined table list.",
  "frontend/src/game/types.ts": "Defines shared math-game types for questions, round state, results, and feedback.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading and managing identities and login state.",
  "frontend/src/hooks/useProgress.ts": "Tracks local and backend progress, storing attempts, best scores, and stars per activity.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend calls in React Query hooks for profiles, results, progress, rewards, and stats.",
  "frontend/src/hooks/useStickerRewards.ts": "Manages sticker rewards locally, awarding and retrieving earned stickers.",
  "frontend/src/hooks/useTimesTablesPractice.ts": "Stores and updates times‑tables practice state including tables, difficulty, score, and attempts.",
  "frontend/src/index.css": "Defines Tailwind layers and theme variables for light/dark modes and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the app with React, Internet Identity provider, and React Query client.",
  "frontend/src/pages/ActivitySelectPage.tsx": "Renders activity selection UI with difficulty options, progress display, and navigation to play.",
  "frontend/src/pages/AgeSelectPage.tsx": "Displays age group options and saves the selected group before navigating to activity selection.",
  "frontend/src/pages/HelpPage.tsx": "Lists help topics and renders video cards for learning math concepts.",
  "frontend/src/pages/HomePage.tsx": "Shows the main menu with navigation to games, times tables, help, and progress, adapting behavior based on age group selection.",
  "frontend/src/pages/play/PlayRoundPage.tsx": "Runs a game round by generating questions, handling answers, tracking progress, and saving results.",
  "frontend/src/pages/play/RoundSummaryPage.tsx": "Shows round results, awards stickers, updates progress, and optionally syncs data to the backend.",
  "frontend/src/pages/ProgressPage.tsx": "Displays total stars, activity progress, and earned stickers for the selected age group.",
  "frontend/src/pages/SettingsPage.tsx": "Allows changing age group and managing login/logout using Internet Identity.",
  "frontend/src/pages/times-tables/TimesTablesLearningView.tsx": "Interactive view for browsing and displaying multiplication tables with navigation and table buttons.",
  "frontend/src/pages/times-tables/TimesTablesPage.tsx": "Main times tables page with tabs switching between learning and practice modes.",
  "frontend/src/pages/times-tables/TimesTablesPracticeView.tsx": "Practice mode handling question generation, user answers, scoring, and progress tracking across selected tables.",
  "frontend/src/rewards/stickers.ts": "Defines sticker rewards and a deterministic selector based on completion count.",
  "frontend/src/state/ageGroup.ts": "Defines age group metadata and helpers for converting between frontend and backend age group formats.",
  "frontend/src/state/AgeGroupContext.tsx": "Context provider for storing and updating the selected age group using localStorage.",
  "frontend/src/theme.ts": "Theme configuration describing colors, typography, and design principles for the kids’ math app.",
  "frontend/src/utils/urlParams.ts": "Utility functions for retrieving, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, animations, and layout settings for the app.",
  "project_state.json": "Defines the project’s state for a kids’ math game, including app goals, UI guidelines, age‑group structure, required stickers, known issues, and existing feature versions. Serves as the central specification and planning reference for gameplay, visuals, and progression."
}