{
  "backend/main.mo": "Defines math game domain types, comparison helpers, authorization mixin, and in-memory maps for user progress, profiles, and times-tables data.",
  "feature_evidence.json": "Feature evidence report mapping feature requirements to affected frontend files and components with confidence levels.",
  "frontend-file-summaries.txt": "Pre-written summaries of major frontend files covering routing, styling, game logic, hooks, and UI components.",
  "frontend/index.css": "Global Tailwind-based CSS defining theme tokens for light/dark modes and applying background and text styles.",
  "frontend/index.html": "Basic HTML shell loading the React app entrypoint into a root div.",
  "frontend/public/videos/README.txt": "Instructions for placing educational MP4 videos with required filenames and recommended formats.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router with age-group guards and page routes wrapped in the global layout and error boundary.",
  "frontend/src/components/errors/GlobalErrorBoundary.tsx": "React error boundary that captures runtime errors and displays a friendly recovery screen with reload option.",
  "frontend/src/components/game/AnswerPad.tsx": "A numeric keypad component that collects number input and submits it via a callback.",
  "frontend/src/components/game/DifficultySelector.tsx": "Renders a card with radio options for selecting a difficulty level.",
  "frontend/src/components/game/FeedbackBanner.tsx": "Displays a success or error banner with an icon and randomized message.",
  "frontend/src/components/help/helpTopics.ts": "Defines help topic metadata including IDs, titles, video files, and fallback explanations.",
  "frontend/src/components/help/HelpVideoCard.tsx": "Shows a help video for a topic with fallback text if the video fails to load.",
  "frontend/src/components/layout/KidLayout.tsx": "Page layout with background, navigation, age badge, main content, and footer.",
  "frontend/src/components/layout/PageHeader.tsx": "Centered page header with title, optional subtitle, emoji, and mascot.",
  "frontend/src/components/layout/PageShell.tsx": "Wrapper that constrains page width using preset max-width classes.",
  "frontend/src/components/layout/SelectedAgeBadge.tsx": "Fixed badge showing the currently selected age group using context data.",
  "frontend/src/components/mascot/Mascot.tsx": "Displays an animated mascot image with fallbacks based on mascot state.",
  "frontend/src/components/nav/MainNav.tsx": "Top navigation bar with route buttons and active-state highlighting.",
  "frontend/src/components/progress/StarsRow.tsx": "Renders animated star icons showing earned versus total stars.",
  "frontend/src/components/progress/StickerBoard.tsx": "Grid-based sticker board that displays earned stickers with image fallback handling.",
  "frontend/src/game/difficulty.ts": "Defines difficulty options, maps frontend to backend difficulty, and provides difficulty multipliers.",
  "frontend/src/game/questionGenerator.ts": "Generates math questions with number ranges based on age group, game type, and difficulty, including addition, subtraction, multiplication, and division.",
  "frontend/src/game/roundEngine.ts": "Manages round state, answering, progression, completion checks, and computes final round results including stars and time spent.",
  "frontend/src/game/timesTables.ts": "Builds times table data and generates times-table questions, with optional difficulty-based question counts.",
  "frontend/src/game/types.ts": "Defines shared types for math questions, round state, round results, and feedback states.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login flow, identity state management, and AuthClient setup via a React context.",
  "frontend/src/hooks/useProgress.ts": "Tracks local progress for game attempts and exposes backend progress when authenticated.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend calls with React Query for profiles, results, progress summaries, rewards, and times table stats.",
  "frontend/src/hooks/useStickerRewards.ts": "Manages local sticker reward storage and awarding logic based on completion count.",
  "frontend/src/hooks/useTimesTablesPractice.ts": "Stores and updates times table practice settings, score, attempts, and difficulty in local storage.",
  "frontend/src/index.css": "Defines Tailwind base layers and custom CSS variables for light and dark themes, plus utility classes for success and warning colors.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/ActivitySelectPage.tsx": "Displays selectable math activities and difficulty options, storing difficulty and navigating to the chosen activity.",
  "frontend/src/pages/AgeSelectPage.tsx": "Shows age group options and updates the selected age group before navigating to the activity selector.",
  "frontend/src/pages/HelpPage.tsx": "Lists help topics and renders video cards for learning resources.",
  "frontend/src/pages/HomePage.tsx": "Provides the main menu for games, times tables, help, and progress, adjusting navigation based on age group selection.",
  "frontend/src/pages/play/PlayRoundPage.tsx": "Manages gameplay for a round: generates questions, tracks answers and progress, handles feedback, difficulty, and stores results in sessionStorage.",
  "frontend/src/pages/play/RoundSummaryPage.tsx": "Loads the stored round result, displays performance summary, awards stickers, updates progress, and syncs results to backend if authenticated.",
  "frontend/src/pages/ProgressPage.tsx": "Displays user progress, including stars, activity stats, and earned stickers for the selected age group.",
  "frontend/src/pages/SettingsPage.tsx": "Allows users to change age group and manage authentication using Internet Identity, with navigation back to home.",
  "frontend/src/pages/times-tables/TimesTablesLearningView.tsx": "Displays a selectable multiplication table and shows equations for the chosen table with navigation between tables.",
  "frontend/src/pages/times-tables/TimesTablesPage.tsx": "Provides a tabbed interface to switch between learning and practicing multiplication tables.",
  "frontend/src/pages/times-tables/TimesTablesPracticeView.tsx": "Runs times tables practice sessions with chosen tables and difficulty, checking answers, giving feedback, and recording stats.",
  "frontend/src/rewards/stickers.ts": "Defines sticker reward metadata and provides a deterministic reward selector based on completion count.",
  "frontend/src/state/ageGroup.ts": "Defines age group metadata and utilities for converting between frontend and backend age group enums.",
  "frontend/src/state/AgeGroupContext.tsx": "Stores and provides the selected age group using React context with persistence in localStorage.",
  "frontend/src/theme.ts": "Contains theme configuration describing colors, typography, and design guidelines for the kids math app.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL params (including hash-based), persist them in sessionStorage, and clear them from the URL.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and component styles for a pastel, kid‑friendly UI.",
  "project_state.json": "Describes the project state, known regressions, and required features for restoring UI screens, styling, mascot animations, and sticker rewards."
}