{
  "kind": "build_request",
  "title": "Add difficulty selection (Easy/Medium/Hard/Math Wizard) and sticker rewards chart",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-17",
      "text": "Add a difficulty selector with four options — \"Easy\", \"Medium\", \"Hard\", and \"Math Wizard\" — that the child can choose before starting an Operations round (addition/subtraction/multiplication/division). The selected difficulty must be clearly shown during gameplay and included in the round result data passed to the Round Summary screen.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "That is perfect but can we a option the can choose like easy,  medium, hard, math wizard please"
        ]
      },
      "acceptanceCriteria": [
        "On the Operations flow (starting from the activity selection), the user can choose exactly one difficulty: Easy, Medium, Hard, or Math Wizard before the round begins.",
        "During the round (PlayRoundPage), the UI shows the selected difficulty label in a readable way.",
        "The stored round result (sessionStorage key \"math-game-result\") includes the selected difficulty so the Round Summary can read it."
      ]
    },
    {
      "id": "REQ-18",
      "text": "Update question generation and round configuration so difficulty meaningfully changes gameplay for Operations rounds, while still respecting the existing age-group ranges. Difficulty must be applied consistently across all four operations.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "can we a option the can choose like easy,  medium, hard, math wizard please"
        ]
      },
      "acceptanceCriteria": [
        "For the same age group and game type, selecting different difficulties produces measurably different question sets (e.g., wider operand ranges and/or more questions for harder difficulties).",
        "The difficulty logic applies to addition, subtraction, multiplication, and division question generation (no operation is left unchanged).",
        "No crashes occur when starting a round with any difficulty across all age groups."
      ]
    },
    {
      "id": "REQ-19",
      "text": "Add the same four difficulty options (Easy/Medium/Hard/Math Wizard) to Times Tables Practice, and apply the chosen difficulty to practice configuration (e.g., number of questions and/or question mix). The selected difficulty must be visible during practice and reflected in the practice completion view.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "can we a option the can choose like easy,  medium, hard, math wizard please"
        ]
      },
      "acceptanceCriteria": [
        "Times Tables Practice includes a difficulty selector with exactly: Easy, Medium, Hard, Math Wizard.",
        "Starting practice uses the selected difficulty to adjust the session (e.g., question count and/or other difficulty-related settings).",
        "While practicing, the UI indicates the selected difficulty.",
        "After practice completes, the completion summary remains functional and still shows stars/score as before."
      ]
    },
    {
      "id": "REQ-20",
      "text": "Implement a rewards system that grants a fun sticker reward each time a child completes a level, and display a sticker chart. Define \"level completion\" for Operations rounds as reaching the Round Summary screen (i.e., finishing a round). Persist rewards between sessions for anonymous users (localStorage), and keep the system compatible with logged-in users (do not break existing cloud progress).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "can we have fun stickers and a chart so every time they complete a level they get a reward"
        ]
      },
      "acceptanceCriteria": [
        "When the Round Summary screen is reached for an Operations round, the app awards exactly one sticker reward for that completion event.",
        "Sticker rewards persist after page refresh/reopen for anonymous users using localStorage.",
        "A new \"Sticker Chart\" section is visible on the Progress page, showing earned stickers in a simple grid/chart layout.",
        "The existing stars/attempts/best-score progress display continues to work as before."
      ]
    },
    {
      "id": "REQ-21",
      "text": "Extend backend progress storage to support recording completed levels and earned sticker rewards for authenticated users, and expose query/mutation methods needed by the frontend to read and update these rewards without breaking existing progress APIs (e.g., getProgressSummary, submitResult). Include the selected difficulty with submitted results so rewards and progress can be tracked by difficulty.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "can we have fun stickers and a chart so every time they complete a level they get a reward",
          "can we a option the can choose like easy,  medium, hard, math wizard please"
        ]
      },
      "acceptanceCriteria": [
        "Backend can record a completed level event associated with: caller, age group, game type, and difficulty, and can associate an earned sticker with that completion.",
        "Frontend can fetch authenticated user sticker/reward data via a backend query method (or extension of an existing method) without requiring any third-party services.",
        "Submitting an authenticated round result includes difficulty and does not break existing callers (frontend remains able to submit results and load progress summary)."
      ]
    },
    {
      "id": "REQ-22",
      "text": "Integrate generated sticker images as static assets and use them in the rewards UI (Round Summary reward moment and Progress page sticker chart). Store generated images under frontend/public/assets/generated and reference them directly from the frontend.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "can we have fun stickers and a chart so every time they complete a level they get a reward"
        ]
      },
      "acceptanceCriteria": [
        "Sticker images are present under frontend/public/assets/generated with the exact filenames specified in imageRequirements.required.",
        "Rewards UI uses these static image assets (not fetched through the backend).",
        "If an image fails to load, the UI still renders with a simple fallback (e.g., showing the sticker name as text) and does not crash."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/main.tsx or other paths listed in SYSTEM_CONTEXT.frontend.immutablePaths; compose existing components instead.",
    "Backend must remain a single Motoko actor with all logic in backend/main.mo; only add backend/migration.mo if an upgrade-safe state migration is actually required by the implementation.",
    "Use English for all user-facing text added by this change."
  ],
  "nonGoals": [
    "Add third-party authentication providers (only Internet Identity is allowed).",
    "Add real-time features (WebSockets/push notifications/chat).",
    "Introduce external databases or non-Motoko backend services."
  ],
  "imageRequirements": {
    "required": [
      "Cute star sticker, bright pastel, thick outline, kid-friendly (sticker-star.dim_256x256.png)",
      "Cute rocket sticker, bright pastel, thick outline, kid-friendly (sticker-rocket.dim_256x256.png)",
      "Cute dinosaur sticker, bright pastel, thick outline, kid-friendly (sticker-dino.dim_256x256.png)",
      "Cute unicorn sticker, bright pastel, thick outline, kid-friendly (sticker-unicorn.dim_256x256.png)",
      "Cute wizard hat sticker, bright pastel, thick outline, kid-friendly (sticker-wizard-hat.dim_256x256.png)",
      "Cute trophy sticker, bright pastel, thick outline, kid-friendly (sticker-trophy.dim_256x256.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}