{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Difficulty selection + sticker rewards chart for Operations and Times Tables Practice",
  "requirements": [
    {
      "id": "REQ-17",
      "summary": "Add a 4-option difficulty selector for Operations rounds, show it during gameplay, and include it in stored round results for Round Summary.",
      "acceptanceCriteria": [
        "On the Operations flow (starting from the activity selection), the user can choose exactly one difficulty: Easy, Medium, Hard, or Math Wizard before the round begins.",
        "During the round (PlayRoundPage), the UI shows the selected difficulty label in a readable way.",
        "The stored round result (sessionStorage key \"math-game-result\") includes the selected difficulty so the Round Summary can read it."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/types.ts",
          "operation": "modify",
          "description": "Extend RoundResult to include a frontend difficulty field (supporting Easy/Medium/Hard/Math Wizard) so it can be persisted to sessionStorage and read by RoundSummaryPage."
        },
        {
          "path": "frontend/src/game/difficulty.ts",
          "operation": "create",
          "description": "Create shared difficulty definitions (4 options, display labels, and a safe mapping to backend Difficulty for authenticated submissions where needed)."
        },
        {
          "path": "frontend/src/components/game/DifficultySelector.tsx",
          "operation": "create",
          "description": "Add a reusable difficulty selector UI for choosing exactly one of four options; use shadcn-ui form controls (e.g., RadioGroup / Button variants) for consistent styling. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ActivitySelectPage.tsx",
          "operation": "modify",
          "description": "Wire the difficulty selector into the Operations start flow (before navigating to /play/$gameType), persist the chosen difficulty in sessionStorage for the upcoming round, and ensure exactly one difficulty is selected."
        },
        {
          "path": "frontend/src/pages/play/PlayRoundPage.tsx",
          "operation": "modify",
          "description": "Read selected difficulty from sessionStorage at round start, show the selected difficulty label during gameplay, and include difficulty in the sessionStorage \"math-game-result\" payload."
        },
        {
          "path": "frontend/src/pages/play/RoundSummaryPage.tsx",
          "operation": "modify",
          "description": "Read and display the selected difficulty from the stored round result; ensure the summary remains functional when the result includes the new difficulty field."
        }
      ]
    },
    {
      "id": "REQ-18",
      "summary": "Apply difficulty to Operations question generation and round configuration across addition/subtraction/multiplication/division while respecting age-group ranges.",
      "acceptanceCriteria": [
        "For the same age group and game type, selecting different difficulties produces measurably different question sets (e.g., wider operand ranges and/or more questions for harder difficulties).",
        "The difficulty logic applies to addition, subtraction, multiplication, and division question generation (no operation is left unchanged).",
        "No crashes occur when starting a round with any difficulty across all age groups."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/questionGenerator.ts",
          "operation": "modify",
          "description": "Update question generation to accept frontend difficulty and adjust configuration (e.g., question count and operand ranges) in a consistent way for all four operations while keeping the age-group base ranges as the baseline."
        },
        {
          "path": "frontend/src/pages/play/PlayRoundPage.tsx",
          "operation": "modify",
          "description": "Pass the selected difficulty into generateQuestions and use difficulty-adjusted question count/configuration when creating the round."
        },
        {
          "path": "frontend/src/game/roundEngine.ts",
          "operation": "modify",
          "description": "Ensure round result creation remains compatible with variable question counts and includes any new result metadata needed by the updated flow."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Add the same 4-option difficulty selector to Times Tables Practice and apply it to practice session configuration; show difficulty during practice and on completion.",
      "acceptanceCriteria": [
        "Times Tables Practice includes a difficulty selector with exactly: Easy, Medium, Hard, Math Wizard.",
        "Starting practice uses the selected difficulty to adjust the session (e.g., question count and/or other difficulty-related settings).",
        "While practicing, the UI indicates the selected difficulty.",
        "After practice completes, the completion summary remains functional and still shows stars/score as before."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useTimesTablesPractice.ts",
          "operation": "modify",
          "description": "Persist and expose the selected Times Tables Practice difficulty in localStorage alongside existing practice state (without breaking existing stored state reads)."
        },
        {
          "path": "frontend/src/pages/times-tables/TimesTablesPracticeView.tsx",
          "operation": "modify",
          "description": "Add difficulty selector UI (reuse DifficultySelector), require exactly one difficulty before starting, adjust practice session configuration (e.g., number of questions and/or question selection rules) by difficulty, and show the selected difficulty during practice and on completion."
        },
        {
          "path": "frontend/src/game/timesTables.ts",
          "operation": "modify",
          "description": "Add optional difficulty-aware controls for times tables question generation (e.g., allow caller to request different question counts and/or distribution) while keeping existing defaults working."
        },
        {
          "path": "frontend/src/components/game/DifficultySelector.tsx",
          "operation": "modify",
          "description": "Ensure DifficultySelector is flexible enough to be reused in Times Tables Practice (layout/size props as needed) while keeping the same four choices. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-20",
      "summary": "Implement sticker rewards awarded on Operations Round Summary arrival; persist for anonymous users via localStorage and show a Sticker Chart section on Progress page without breaking existing progress UI.",
      "acceptanceCriteria": [
        "When the Round Summary screen is reached for an Operations round, the app awards exactly one sticker reward for that completion event.",
        "Sticker rewards persist after page refresh/reopen for anonymous users using localStorage.",
        "A new \"Sticker Chart\" section is visible on the Progress page, showing earned stickers in a simple grid/chart layout.",
        "The existing stars/attempts/best-score progress display continues to work as before."
      ],
      "file_operations": [
        {
          "path": "frontend/src/rewards/stickers.ts",
          "operation": "create",
          "description": "Define sticker reward catalog (names + static asset paths) and deterministic selection logic for awarding exactly one sticker per Operations completion."
        },
        {
          "path": "frontend/src/hooks/useStickerRewards.ts",
          "operation": "create",
          "description": "Create a hook to award and read sticker rewards, persisting anonymous rewards in localStorage; keep behavior compatible with authenticated users by optionally syncing via existing backend capabilities where available (without breaking cloud progress)."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add react-query hooks/mutations for reading/updating authenticated sticker rewards using existing backend actor functions (e.g., getEarnedRewards/addEarnedReward), while preserving existing progress-related queries/mutations."
        },
        {
          "path": "frontend/src/pages/play/RoundSummaryPage.tsx",
          "operation": "modify",
          "description": "On Round Summary load for an Operations round, award exactly one sticker reward (one-time per completion event), show a small 'reward moment' section (sticker image + name), and keep existing stars/results UI working."
        },
        {
          "path": "frontend/src/pages/ProgressPage.tsx",
          "operation": "modify",
          "description": "Add a new 'Sticker Chart' section showing earned stickers in a simple grid; ensure existing stars/attempts/best-score and Cloud Progress sections remain unchanged and functional."
        }
      ]
    },
    {
      "id": "REQ-22",
      "summary": "Add generated sticker images as static assets and use them in the rewards UI with a no-crash fallback if images fail to load.",
      "acceptanceCriteria": [
        "Sticker images are present under frontend/public/assets/generated with the exact filenames specified in imageRequirements.required.",
        "Rewards UI uses these static image assets (not fetched through the backend).",
        "If an image fails to load, the UI still renders with a simple fallback (e.g., showing the sticker name as text) and does not crash."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/sticker-star.dim_256x256.png",
          "operation": "create",
          "description": "Add generated static sticker image asset at frontend/public/assets/generated/sticker-star.dim_256x256.png."
        },
        {
          "path": "frontend/public/assets/generated/sticker-rocket.dim_256x256.png",
          "operation": "create",
          "description": "Add generated static sticker image asset at frontend/public/assets/generated/sticker-rocket.dim_256x256.png."
        },
        {
          "path": "frontend/public/assets/generated/sticker-dino.dim_256x256.png",
          "operation": "create",
          "description": "Add generated static sticker image asset at frontend/public/assets/generated/sticker-dino.dim_256x256.png."
        },
        {
          "path": "frontend/public/assets/generated/sticker-unicorn.dim_256x256.png",
          "operation": "create",
          "description": "Add generated static sticker image asset at frontend/public/assets/generated/sticker-unicorn.dim_256x256.png."
        },
        {
          "path": "frontend/public/assets/generated/sticker-wizard-hat.dim_256x256.png",
          "operation": "create",
          "description": "Add generated static sticker image asset at frontend/public/assets/generated/sticker-wizard-hat.dim_256x256.png."
        },
        {
          "path": "frontend/public/assets/generated/sticker-trophy.dim_256x256.png",
          "operation": "create",
          "description": "Add generated static sticker image asset at frontend/public/assets/generated/sticker-trophy.dim_256x256.png."
        },
        {
          "path": "frontend/src/rewards/stickers.ts",
          "operation": "modify",
          "description": "Reference the static sticker assets using the exact workspace paths (frontend/public/assets/generated/*.png) and include metadata needed for UI rendering and text fallback when an image load fails."
        },
        {
          "path": "frontend/src/pages/play/RoundSummaryPage.tsx",
          "operation": "modify",
          "description": "Render awarded sticker image from static assets with a safe onError fallback to sticker name text so the UI never crashes on missing/failed images."
        },
        {
          "path": "frontend/src/pages/ProgressPage.tsx",
          "operation": "modify",
          "description": "Render sticker chart images from static assets with a safe onError fallback to sticker name text so the UI never crashes on missing/failed images."
        }
      ]
    }
  ]
}