{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore age selection, pastel theme cohesion, animated mascot, and sticker-board rewards UI",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure age-group selection is always accessible and reliably enforced via routing guards, with all age cards rendered and selection persisted.",
      "acceptanceCriteria": [
        "When no age group is selected, the app provides a clear way to reach age-group selection and successfully navigates to /age-select.",
        "/age-select renders all configured age-group options as selectable cards and selecting one navigates to /activity-select.",
        "Age-group selection persists across page reloads (existing localStorage-based behavior remains working)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Harden age-group guard coverage by adding a Progress route guard (and any other routes that should require an age group) that reliably redirects to /age-select when selectedAgeGroup is missing."
        },
        {
          "path": "frontend/src/components/nav/MainNav.tsx",
          "operation": "modify",
          "description": "Add a persistent navigation action to reach /age-select so children can always access age-group selection from anywhere. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Ensure the Home flow includes an always-visible, clear call-to-action to change/pick an age group (not only on first-time state), navigating to /age-select. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AgeSelectPage.tsx",
          "operation": "modify",
          "description": "Confirm the Age Select screen consistently renders all AGE_GROUPS as full selectable cards and that selection triggers persistence via AgeGroupContext then navigates to /activity-select. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/state/AgeGroupContext.tsx",
          "operation": "modify",
          "description": "Make localStorage persistence more defensive (e.g., validate stored value against known AgeGroupKey values and handle invalid/unknown values by treating as null) so guards reliably route to /age-select when needed."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Re-apply the soft pastel theme across core screens and fix unintended global bold typography while keeping high-contrast legible text.",
      "acceptanceCriteria": [
        "Core screens (Home, Age Select, Activity Select, Play, Round Summary, Progress) use the pastel theme colors from the global theme tokens (background/primary/secondary/accent/etc.).",
        "Default paragraph/body text is not rendered as overly bold; bold is reserved for intentional emphasis (e.g., key numbers like score/stars).",
        "No visual regressions in readability: text remains dark/high-contrast against the pastel backgrounds."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Adjust base typography defaults to prevent an app-wide 'bold' regression (e.g., ensure body copy defaults to normal font-weight) while preserving theme tokens and high-contrast text on pastel backgrounds."
        },
        {
          "path": "frontend/src/components/layout/PageHeader.tsx",
          "operation": "modify",
          "description": "Refine header typography so only titles are bold for emphasis, while subtitles/body copy remain normal/medium weight and readable against the pastel theme. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Align Home page card and helper text styling with pastel theme tokens and non-bold body text defaults; keep bold only for intentional emphasis. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AgeSelectPage.tsx",
          "operation": "modify",
          "description": "Align Age Select cards (titles/descriptions/buttons) to pastel theme tokens and avoid overly-bold body copy while keeping headings prominent. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ActivitySelectPage.tsx",
          "operation": "modify",
          "description": "Align Activity Select card and description typography to the restored pastel theme, ensuring descriptions are not overly bold and remain high-contrast/legible. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/play/RoundSummaryPage.tsx",
          "operation": "modify",
          "description": "Ensure Round Summary uses pastel token backgrounds/borders consistently (especially the rewards moment) and reserves bold for key numbers and celebratory headings only. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ProgressPage.tsx",
          "operation": "modify",
          "description": "Ensure Progress uses the pastel theme tokens consistently and avoids bold body copy except for key numbers (e.g., total stars). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Restore mascot rendering and visible animations on key screens with graceful fallback when assets are missing.",
      "acceptanceCriteria": [
        "Mascot images referenced by the Mascot component load correctly from static assets and display on Home, Age Select, Progress, and Round Summary pages.",
        "Mascot animation classes used by the Mascot component produce visible animation (float/cheer/wiggle) in the UI.",
        "If an expected mascot image asset is missing, the UI fails gracefully (e.g., shows an accessible placeholder) rather than appearing blank."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/mascot/Mascot.tsx",
          "operation": "modify",
          "description": "Add robust image loading/fallback handling (onError -> accessible placeholder) while preserving existing animation class behavior for idle float, cheer bounce-in, and encourage wiggle. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Confirm Home continues to render the Mascot component (idle) and that layout/styling changes do not hide or clip animations. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AgeSelectPage.tsx",
          "operation": "modify",
          "description": "Confirm Age Select continues to render the Mascot component (idle) and that layout/styling changes do not hide or clip animations. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ProgressPage.tsx",
          "operation": "modify",
          "description": "Confirm Progress continues to render the Mascot component and that layout/styling changes do not hide or clip animations. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/play/RoundSummaryPage.tsx",
          "operation": "modify",
          "description": "Confirm Round Summary continues to render the Mascot component (cheer) and that layout/styling changes do not hide or clip animations. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Ensure one sticker is awarded per completed round at Round Summary and add a dedicated sticker-board view in Progress with persisted, resilient rendering.",
      "acceptanceCriteria": [
        "Completing an operations round and reaching the Round Summary screen awards exactly one sticker for that completion and shows the earned sticker on the Round Summary screen.",
        "The Progress area includes a sticker-board UI that displays earned stickers placed into board slots in earned order (with empty slots visible when not yet earned).",
        "Sticker rewards persist across reloads for anonymous users via localStorage (no loss of previously earned stickers).",
        "If a sticker image fails to load, the sticker-board view shows a fallback (e.g., the sticker emoji) instead of a broken image icon."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/sticker-board-bg.dim_1200x800.png",
          "operation": "create",
          "description": "Add the generated sticker board background illustration as a static asset at frontend/public/assets/generated/sticker-board-bg.dim_1200x800.png (must be served statically; do not route through backend)."
        },
        {
          "path": "frontend/src/hooks/useStickerRewards.ts",
          "operation": "modify",
          "description": "Harden localStorage-backed sticker persistence and awarding logic (ensure awardSticker is safe against stale state and always increments exactly once per completion flow) while keeping anonymous-user persistence."
        },
        {
          "path": "frontend/src/pages/play/RoundSummaryPage.tsx",
          "operation": "modify",
          "description": "Ensure the rewards moment on Round Summary shows the newly earned sticker and that awarding occurs exactly once per round completion (defined as reaching Round Summary), with graceful image fallback already present. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/progress/StickerBoard.tsx",
          "operation": "create",
          "description": "Create a StickerBoard component that renders a board-style presentation using the static background (frontend/public/assets/generated/sticker-board-bg.dim_1200x800.png), places earned stickers into slots in order, shows empty slots for unearned, and uses emoji fallback on image error. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ProgressPage.tsx",
          "operation": "modify",
          "description": "Replace the plain sticker grid/list presentation with the StickerBoard component within the Progress area, ensuring earned-order placement and visible empty slots while preserving localStorage persistence behavior. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Apply a single cohesive, kid-friendly visual theme pass (soft pastels, rounded shapes, playful typography) consistently across Home, Age Select, Round Summary rewards moment, and Progress sticker board.",
      "acceptanceCriteria": [
        "The same design language (colors, rounded corners, shadows, spacing) is consistently applied across the key screens.",
        "No screen appears to use a mismatched/unstyled fallback look compared to the rest of the app."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/KidLayout.tsx",
          "operation": "modify",
          "description": "Ensure the global page background and container spacing consistently support the pastel theme and do not introduce harsh contrast; keep the static background image usage intact. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Make a cohesive theme pass via global tokens/utilities: reinforce soft pastel feel (without reducing readability), consistent roundedness, and consistent default typography weight across screens."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Unify Home screen card styling (rounded corners, borders, shadows, spacing) and typography with the restored theme pass. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AgeSelectPage.tsx",
          "operation": "modify",
          "description": "Unify Age Select card styling (rounded corners, borders, shadows, spacing) and typography with the restored theme pass. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/play/RoundSummaryPage.tsx",
          "operation": "modify",
          "description": "Unify the Round Summary rewards moment styling with the theme pass (soft pastel panels, rounded shapes, consistent shadows) while keeping emphasis on key results. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/progress/StickerBoard.tsx",
          "operation": "modify",
          "description": "Apply the same visual language (colors, rounded corners, shadows, spacing) to the StickerBoard so it matches other key screens and does not look like an unstyled add-on. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ProgressPage.tsx",
          "operation": "modify",
          "description": "Ensure Progress page sections (totals, activities, sticker board) use consistent theme tokens and styling patterns to avoid any mismatched/fallback look. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}